{"summary": "This Request for Quotation (RFQ) issued by the Federal Highway Administration (FHWA) seeks proposals for Microsoft (MS) 365 Project Suite (MS365) Support. The FHWA aims to enhance its project management capabilities and streamline operations by implementing a more robust and customized MS365 Project Suite architecture. The selected contractor will be responsible for configuring and implementing Project Online and Project for the Web, ensuring compliance with DOT requirements and federal standards. The core objective is to provide fully functional and configured OA workspaces within the MS365 Project Suite tenant, including role-based access, customizable dashboards, and training materials for OCIO staff. This project addresses the business challenge of modernizing the Department of Transportation's (DOT) Project Portfolio Management (PPM) operations, improving efficiency, and protecting sensitive information. The RFQ is set aside for small businesses under the GWAC 8(a) STARS III contract, emphasizing the importance of corporate experience and technical approach in the evaluation process. The project involves a phased approach, including project kick-off, assessment, configuration, pilot testing, training, implementation, and phase-out planning.", "document_details": {"rfq_number": "693JJ325Q000035", "title": "MS365 Project Suite (MS365) Support", "date_issued": null, "file_name": "MS365 RFQ updated.1755004298603.docx"}, "issuing_organization": {"name": "Federal Highway Administration (FHWA)", "office": "Office of Acquisitions and Grants Management", "department": "Department of Transportation (DOT)"}, "key_dates": {"submission_deadline": null, "q_and_a_period": null, "decision_timeline": null, "kickoff_meeting": "Within ten (10) business days after award"}, "submission_requirements": {"format": "Electronic as Adobe (.pdf) files", "volumes": ["Volume 1 - Technical Quote (not to exceed 10 pages)", "Volume 2 - Price Quote"], "email_size_limit": "10 Megabytes", "required_information": ["Cover Letter and Table of Contents", "Technical Approach", "Corporate Experience", "Staffing Approach", "Price Quote", "Organizational Information"], "submission_method": "Electronic", "contact_details": {"email": null, "address": null}}, "evaluation_criteria": {"factors": [{"factor": "Technical Approach", "weight": "More important than Corporate Experience and Staffing Approach"}, {"factor": "Corporate Experience", "weight": null}, {"factor": "Staffing Approach", "weight": null}, {"factor": "Price", "weight": null}], "method": "Best Value"}, "project_scope": {"background": "DOT is the United States Government's principal agency for transportation of all Americans and provides essential transportation safety services.", "objective": "To configure and implement Project Online and Project for the Web to accommodate current and future users.", "requirements": ["Recommendations for configuration of the DOT Project Online.", "DOT environments configured for each OA.", "Role-based access.", "Customizable dashboards and reporting capabilities.", "Training and administrative guidance artifacts will be provided for OCIO staff to administer and maintain the product."], "tasks": ["Project Kick-off", "Project Administration and Oversight", "Discovery and Assessment", "Configuration/Pilot", "Training", "Implementation", "Project Reporting/Delivery", "Phase-out Planning Services"], "personnel_requirements": ["Project/Task Manager", "M365 Project Suite Administrator"]}, "budget_information": {"type": "Firm-Fixed-Price (FFP)", "clin_chart": "Offerors shall include their proposed labor categories for the M365 support in the following table. Offerors can propose their own labor categories and hours.", "payment_terms": "12 equal payments (each year) in accordance with work completed and accepted by the Government on monthly basis."}, "contract_terms": {"type": "Firm-Fixed-Price (FFP) Task Order", "period_of_performance": "Base period: 12 months, Option period: 12 months", "option_to_extend_services": "The Government may require continued performance of any services within the limits and at the rates specified in the contract. The option provision may be exercised more than once, but the total extension of performance hereunder shall not exceed six months.", "place_of_performance": "Department of Transportation, OST, Office of the Chief Information Officer (OCIO), 1200 New Jersey Avenue, SE., Washington, D.C. 20590.", "clauses_incorporated": ["FAR 52.217-8 OPTION TO EXTEND SERVICES (NOV 1999)", "FAR 52.217-9 OPTION TO EXTEND THE TERM OF THE CONTRACT (MAR 2000)", "TAR 1252.232-71 Limitation of Government’s Obligation (NOV 2022)", "TAR 1252.237-73 Key Personnel (NOV 2022)", "TAR 1252.239-93 Information and Communication Technology Accessibility (NOV 2022)"]}}