{"summary": "This Request for Quotation (RFQ) is issued by the IT Acquisition Center of Excellence (ACE) on behalf of the Federal Highway Administration (FHWA), a part of the U.S. Department of Transportation (DOT). The core purpose of this RFQ is to establish a Blanket Purchase Agreement (BPA) for Web Agility Program Support Services (WA3). The DOT aims to procure services to support the daily operations and maintenance of its web platforms, including the Drupal Content Management System (CMS), and to facilitate the design, development, and integration of new web-based applications and content. The client seeks a solution that addresses the need for innovative, best-in-class websites and web infrastructure to support DOT's goals. The key business challenge is to maintain and enhance the DOT's digital presence, ensuring accessibility, compliance with federal standards, and a positive user experience. This RFQ is set aside for small businesses, with the FHWA anticipating awarding approximately four BPA awards. The scope includes project management, operations and maintenance, design and development, content strategy, accessibility compliance, and website analytics support. The BPA will utilize Firm-Fixed-Price (FFP), Time & Materials (T&M)/Labor Hour (LH), or hybrid contract types.", "document_identification": {"rfq_number": "693JJ325Q000011", "amendment": "5", "title": "Web Agility Program Support Services (WA3) Blanket Purchase Agreement (BPA) for the U.S. Department of Transportation (DOT)", "date_issued": "January 16, 2025"}, "issuing_organization": {"name": "IT Acquisition Center of Excellence (ACE)", "office": "Office of Acquisition and Grants Management", "agency": "Federal Highway Administration (FHWA)", "address": "1200 New Jersey Avenue, SE, Washington, DC 20590-0001"}, "contacts": [{"name": "Soha Saifeddine", "title": "Contract Specialist", "email": "soha.saifeddine@dot.gov"}, {"name": "Christina McMurtry", "title": "Contract Specialist", "email": "Christina.McMurtry@dot.gov"}, {"name": "Gunnar Prutz", "title": "Contracting Officer", "email": "Gunnar.Prutz@dot.gov"}], "key_dates": {"technical_questions_due": {"date": "January 29, 2025", "time": "12:00 PM (Noon) Eastern Time (ET)", "method": "e-mail", "contacts": ["soha.saifeddine@dot.gov", "Christina.McMurtry@dot.gov", "Gunnar.Prutz@dot.gov"]}, "phase_i_quotations_due": {"date": "April 8, 2025", "time": "12:00 PM ET", "method": "e-mail", "contacts": ["Christina.McMurtry@dot.gov", "soha.saifeddine@dot.gov", "Gunnar.Prutz@dot.gov"]}, "bpa_period_of_performance": "72 months from the date of award, with the possibility of a 6-month extension, and orders may have a period of performance of up to two years beyond the expiration date of the BPA"}, "submission_requirements": {"format": "Electronic, compatible with Microsoft Office or Adobe Portable Document Format (.PDF)", "page_limitations": {"volume_i_phase_i_technical_quotation": {"part_i_cover_letter_and_table_of_contents": "2 pages", "part_ii_technical_approach": "6 pages", "part_iii_corporate_experience": "10 pages"}, "volume_ii_phase_ii_technical_quotation": {"part_i_cover_letter_and_table_of_contents": "2 pages", "part_ii_technical_approach": "20 pages", "part_iii_management_approach": "no page limit", "part_iv_resumes_of_key_personnel": "3 pages per resume"}, "volume_iii_phase_ii_business_quotation": {"part_i_cover_letter_and_table_of_contents": "2 pages", "part_ii_organizational_conflicts_of_interest": "no page limit", "part_iii_non_price_related_exceptions": "no page limit", "part_iv_far_52.204-25_and_far_52.204-26_telecommunication_equipment_representations": "no page limit", "part_v_tar_1252.239-71_information_technology_security_plan_and_accreditation": "no page limit", "part_vi_price_quotation_assumptions_and_basis_of_estimate": "no page limit", "part_vii_attachment_1_schedule_of_labor_rates": "no page limit"}}, "method": "Electronic submission via email", "email_limit": "Individual emails shall not exceed 25MB", "compliance_check": "A quotation which does not address all the RFQ requirements described in each RFQ Instructions section will be considered non-compliant to that requirement and may be eliminated from further consideration at the Source Selection Official’s discretion."}, "evaluation_criteria": {"phase_i": {"factor_1": "Technical Approach", "factor_2": "Corporate Experience"}, "phase_ii": {"factor_3": "Technical Approach", "factor_4": "Management Approach", "factor_5": "Price"}, "basis_for_award": "Best-value decision developed from a trade-off analysis, considering the evaluation of factors from both Phase I and Phase II. Technical Approach (Factor 1 and Factor 3), Management Approach, and Corporate Experience will be utilized as the technical/non-price related factors in the analysis and are listed above in descending order of importance. All non-price factors, when combined, will be significantly more important than Price. If two or more quotations are determined not to have any substantial technical differences (i.e., are technically equivalent), an award may be made to the lower-priced quotations. However, award may also be made to other than the lowest priced quotations if the Government determines that a higher price is warranted due to technical merit denoted in the evaluation. The Government may also award to other than the highest technically rated quotations, if the Government determines that a higher price is not the best value."}, "project_scope": {"description": "Provide Web Agility Program Support Services (WA3) including project management support; operations and maintenance of the DOT web environments; design and development of new websites, microsites, and web-based applications using web life cycle best practices and standards; information architecture; content strategy and management; graphics development and maintenance; website redesign and migration; accessibility compliance; website analytics and customer feedback tools; data visualizations and integrations with external tools; and other requirements outlined within this SOW.", "objectives": "To provide the OCIO a mechanism for developing innovative, best-in-class websites and web infrastructure to support DOT’s goals including existing and new web projects within the DOT web environment, and to provide readily available support and services in response to OCIO and DOT priorities.", "task_areas": ["Participation in Project Meetings and Accomplishments Reports", "Web Agility Strategic Planning and Governance Support", "Operations and Maintenance of DOT Drupal Environment", "Help Desk Support and Automated Issue Tracking Tool Support", "Website Design, Redesign and Migration Projects / New Websites on Platform", "Content Management Environment", "Development and Accessibility", "Quality Assurance", "Project Management & DOT Drupal Environment Administrator Support", "Operations", "Disaster Recovery", "Training", "New Media Development", "Integrator Support Services Overview", "Additional Requirements"]}, "budget_information": {"estimated_value": "$61,000,000", "period": "72 Month Ordering Period"}, "contract_terms": {"contract_type": "FFP, T&M/LH, or Hybrid", "period_of_performance": "72 months from the date of award, with the possibility of a 6-month extension, and orders may have a period of performance of up to two years beyond the expiration date of the BPA", "payment_terms": "For FFP deliverables, payment upon review and written acceptance. For T&M/LH deliverables, payment no more than monthly.", "reporting_requirements": "Monthly progress reports to the BPA’s COR and the FHWA CO by the 15th of the month following the calendar month being reported. Each BPA Order’s monthly progress reports to the BPA Order’s TOCOR and the FHWA CO by the 15th of the month following the calendar month being reported.", "clauses": ["52.203-17 Contractor Employee Whistleblower Rights (Nov 2023)", "52.204-7 System for Award Management (Nov 2024)", "52.204-13 System for Award Management Maintenance (Oct 2018)", "52.204-24 Representation Regarding Certain Telecommunications and Video Surveillance Services or Equipment (Nov 2021)", "52.204-25 Prohibition on Contracting for Certain Telecommunications and Video Surveillance Services or Equipment (Nov 2021)", "52.204-26 Covered Telecommunications Equipment or Services -Representation (Oct 2020)", "52.217-8 Option to Extend Services (Nov 1999)", "52.227-14 Rights in Data—General (May 2014)", "1252.201-70 Contracting Officer's Representative (Nov 2022)", "1252.223-73 Seat Belt Use Policies and Programs (Nov 2022)", "1252.237-70 Qualifications of Contractor Employees (Nov 2022)", "1252.239-70 Security Requirements for Unclassified Information Technology Resources (Nov 2022)", "1252.239-71 Information Technology Security Plan and Accreditation (Nov 2022)", "1252.239-72 Compliance with Safeguarding DOT Sensitive Data Controls (Nov 2022)", "1252.239-73 Limitations on the Use or Disclosure of Third -Party Contractor Reported Cyber Incident Information (Nov 2022)", "1252.239-74 Safeguarding DOT Sensitive Data and Cyber Incident Reporting (Nov 2022)", "1252.239-75 DOT Protection of Information About Individuals, PII and Privacy Risk Management Requirements (Nov 2022)", "1252.239-89 Technology Modernization (Nov 2022)", "1252.239-90 Technology Upgrades/Refreshment (Nov 2022)", "1239.239-91 Records Management (Nov 2022)", "1252.239-92 Information and Communication Technology Accessibility Notice (Nov 2022)", "1252.239-93 Information and Communication Technology Accessibility (Nov 2022)", "1252.242-70 Dissemination of Contract Information – Educational Institutions (Nov 2022)", "1252.242-71 Contractor Testimony (Nov 2022)", "1252.242-72 Dissemination of Contract Information (Nov 2022)", "1252.237-73 Key Personnel (Nov 2022)", "FHWA LIMITATION OF FUNDS ON TIME AND MATERIALS AND LABOR HOUR ON CONTRACTS AND ORDERS"], "organizational_conflict_of_interest": "Contractor is expressly prohibited from competing on all related work during the performance of the BPA and for a period of three (3) years from the end date of this BPA as a prime contractor, subcontractor, or consultant.", "government_acceptance_period": "14 calendar days to review draft deliverables and make comments for the first iteration of reviews, and 14 calendar days for all subsequent iterations of reviews. The Contractor shall have 14 calendar days to make revisions for the first iteration of reviews, and seven (7) calendar days for all subsequent iterations of reviews and return the revised deliverable to the Government. Upon receipt of the final deliverables, DOT will have 60 calendar days for final review prior to acceptance or providing documented reasons for non-acceptance."}}