{"summary": "This Request for Information (RFI) issued by the Social Security Administration (SSA) seeks information from vendors regarding Web Content Management System (WCMS) solutions. The SSA aims to modernize its digital presence and improve content management through a robust, user-friendly system based on the Drupal platform. The primary objective is to gather market research to inform potential budget and acquisition decisions. The SSA is looking for a comprehensive, turn-key WCMS solution, including Platform as a Service (PaaS) hosting within a FedRAMP-certified environment. The solution must support scalability, security, and compliance with federal standards, including Section 508 compliance and IPv6 compatibility. Key requirements include integration with a Content Delivery Network (CDN), support for Transport Layer Security (TLS), role-based access controls, and comprehensive reporting capabilities. The RFI emphasizes the need for a solution that can handle a high volume of web traffic and data, with an estimated 280 million site visitors per year and 55TB of object requests. The SSA is addressing the challenge of managing and delivering web content effectively and securely while ensuring accessibility and compliance with federal regulations. This RFI is not a solicitation, and the government is not obligated to award a contract based on the responses.", "document_identification": {"type": "RFI", "title": "Web Content Management System (WCMS)", "number": "28321325RI0000040", "date_issued": null}, "issuing_organization": {"name": "Social Security Administration (SSA)", "acronym": "SSA"}, "key_dates": {"submission_deadline": "Refer to Item 10 of the Standard Form 18 (SF 18)", "q_and_a_period": null, "decision_timeline": null}, "submission_requirements": {"format": "Capability statements, published pricing list, and information describing the general approach/solution to addressing the listed requirements. Also, any software license agreement and/or support agreement for this solution, including those specific to Federal Government customers. A completed Voluntary Product Accessibility Template (VPAT) for the solution. A completed Corporate Information Template.", "method": "Electronically via email", "email": "evan.aston@ssa.gov", "subject": "Reference 28321325RI0000040 in the email subject line.", "contact_details": null, "other_instructions": "No telephone, mail, or fax responses will be accepted. Vendors must identify any proprietary information submitted in response to this Request for Information. The proprietary information must be clearly marked as proprietary."}, "evaluation_criteria": {"criteria": ["Demonstrated expertise in the areas described in the RFI", "Technical demonstration of the product and services", "Cloud environment hosting details", "Deployment options", "FEDRAMP authorization details", "Licensing/pricing model", "Section 508 conformance", "Technical support options", "Customization details", "Implementation details", "Successful implementations in live business environments", "Software license agreement and/or support agreement", "Completed Voluntary Product Accessibility Template (VPAT)", "Completed Corporate Information Template"], "weights": null}, "project_scope": {"background": "The Social Security Administration (SSA) is researching the marketplace for potential products or solutions for Web Content Management Systems, including cloud environment hosting and Content Delivery Network (CDN) services.", "purpose": "To seek support services and turn-key solutions for a comprehensive Web Content Management System (WCMS) based on the Drupal platform.", "requirements_summary": "The solution must provide a PaaS environment, be FedRAMP certified, support CDN integration, and meet various technical and security requirements. The solution must also support hosting, system support, and maintenance, including SLAs and 24/7 on-call support. The solution must be compatible with PIV authentication and align with NIST SP 800-73. The solution must be FEDRAMP certified and adhere to industry best practices and comply with relevant security standards and regulations, such as National Institute for Standards and Technology (NIST) and Federal Information Security Management Act (FISMA). The solution must be capable of scaling with increased workloads and maintaining optimal performance under increasing user loads, as well as provide failover mechanisms and disaster recovery capabilities to ensure uninterrupted service availability. The product or solution’s user facing components shall support Section 508 compliance and accessibility guidelines. The product or solution shall support Internet Protocol version 6 (IPv6) and use encrypted communication (e.g., Secure Sockets Layer (SSL)) that meets Federal IT Security standards between all system components. The product or solution shall provide APIs to manage security and access and provide the capability to limit / grant access to certain functionality by Role Based Access Controls. The product or solution shall provide audit / MI /BI capabilities to allow for tracking of user activities, claimant processing and document management. The product or solution shall produce reports on user and systems statistics and processes. The product or solution shall be capable of providing ad hoc and custom reporting functionality on all aspects of the system. The product or solution shall have the ability to generate a system health audit report. The product or solution shall have the capability of generating error and exception reports. The product or solution's data and metadata shall be accessible, retrievable, and exportable by SSA. The product or solution provider shall provide setup, configuration, maintenance and implementation support services as necessary to successfully deploy the product or solution and interoperate with SSA's environment."}, "budget_information": null, "contract_terms": {"type": "RFI", "duration": null}}