{"summary": "This RFP, issued by the U.S. Fish and Wildlife Service (USFWS), seeks proposals for Drupal development services to modernize its public web applications. The core objective is to enhance efficiency, reduce costs, improve user experience, and ensure compliance with security requirements, including Multi-Factor Authentication (MFA) and Zero Trust (ZT). The client aims to achieve this through the modernization of several key applications using Drupal 10 on the Acquia platform. The project addresses the business challenge of updating legacy systems and ensuring the USFWS website ecosystem remains secure, accessible, and user-friendly. The scope includes auditing the current Drupal configuration, comparing search engine options, creating a Reusable Application Framework (RAF), setting up development environments, and modernizing various public-facing applications. A key aspect of this RFP is the emphasis on a multi-application approach within a Drupal multisite setup, leveraging a shared codebase and centralized authentication. The project also involves the integration of Login.gov for secure user authentication and the conversion of legacy formats into modern web-based forms. This RFP is unique in its focus on a comprehensive modernization effort, encompassing multiple applications and requiring expertise in Drupal, Acquia, security, and user experience.", "document_identification": {"rfp_number": "140F1S24Q0055", "title": "Drupal Development", "volume": "Volume I - Technical (Factors 1 & 2)", "date_issued": "July 10, 2024"}, "issuing_organization": {"name": "U.S. Fish and Wildlife Service (USFWS)", "contact_information": {"primary_contact": {"name": "Raj Shekhar", "email": "raj.shekhar@stealth-us.com", "phone": "(206) 495-7898"}}}, "key_dates": {"proposal_validity": "60 days from the date of the proposal submission"}, "submission_requirements": {"format": "Volume 1 - Technical", "method": "Not explicitly stated, but implied to be electronic submission.", "contact_details": {"name": "Raj Shekhar", "email": "raj.shekhar@stealth-us.com", "phone": "(206) 495-7898"}}, "evaluation_criteria": {"factors": [{"factor": "Factor 1 - Technical", "description": "Technical approach, experience, and proposed solution.", "weight": "Not specified"}, {"factor": "Factor 2 – Past Performance", "description": "Relevant past performance and experience.", "weight": "Not specified"}]}, "project_scope_and_background": {"overview": "Modernization of USFWS public web applications using Drupal 10 on the Acquia platform.", "key_objectives": ["Improve efficiency", "Reduce costs", "Enhance user experience", "Comply with security requirements (MFA, ZT)"], "specific_tasks": ["Audit of Drupal Configuration on Acquia", "Search Engine Evaluation", "Reusable Application Framework (RAF) creation", "Environment Setup", "Application Modernization (Harvest Survey, Resident Canadian Goose Application, Eastern Population Sandhill Crane Monitoring, Falconry Ownership Transfers and Reporting, Aerial Observer (Waterfowl), Captive Manatee Modernization, Contact Us Modernization, Optional Task: CarpDAT Invasive Carp Data Monitoring)"], "technology_stack": ["Drupal 10", "Acquia platform", "Login.gov", "Apache Solr", "Power BI"]}, "budget_information": {"budget_type": "Not specified"}, "contract_terms": {"contract_duration": "Not specified", "validity_period": "60 days from the date of the proposal submission"}}