{"summary": "This document is a resume of Samarth Sairam, showcasing his skills and experience as a Software Engineer. It is not an RFP (Request for Proposal) document. The document outlines Samarth's professional background, including his work at Salesforce, Outlier AI, and SAP Labs. His experience includes developing frontend components, implementing CI/CD pipelines, optimizing containerized applications, and building LLM-based applications. The document highlights his technical skills in programming languages such as Python, Java, and JavaScript, as well as his proficiency with developer tools like AWS, Docker, and Kubernetes. The resume also details his projects, including a multisignature wallet and a question-answering tool, and lists his certifications, such as AWS Certified Solutions Architect - Associate and Google Cloud Certified - Professional Data Engineer. The document's purpose is to present Samarth's qualifications and experience to potential employers or clients, demonstrating his ability to contribute to software development projects and his expertise in various technologies.", "document_identification": {"title": "Samarth_Sairam.pdf", "type": "Resume"}, "candidate_details": {"name": "Samarth Sairam", "contact": {"email": "samarthsairam1@gmail.com", "phone": "+1-(945) 208-1863", "linkedin": "LinkedIn", "github": "gtbGithub"}, "location": "New York, NY - 10005"}, "education": [{"institution": "University of Texas at Dallas", "degree": "Master of Science in Computer Science", "gpa": "3.45/4.00", "location": "Dallas, Texas, USA", "graduation_date": "December 2023"}], "work_experience": [{"company": "Salesforce", "title": "Software Engineer - AMTS", "location": "New York City, New York, USA", "dates": "November 2024 - Present", "responsibilities": ["Developed reusable and dynamic frontend components using ReactJS ,React Hooks &JavaScript (ES6) improving UI consistency and user experience across Salesforce’s enterprise applications.", "Reduced defects by 30% through unit and integration testing with Jest andOPA5 , ensuring high code quality and reliable performance.", "Established real-time monitoring with Prometheus andGrafana , adding custom alerts and latency tracking.", "Integrated modern frontend tools such as Babel, npm, Webpack, and Storybook into CRM’s development pipeline , optimizing build processes and ensuring consistent component deployment.", "Implemented CI/CD pipelines with Jenkins , reducing latency by 63% through automated testing with multi-instance endpoints. detection and debugging processes by 57%", "Optimized and deployed containerized apps on AWS EKS , achieving 99.9% uptime and boosted performance by 21%.", "Collaborated in an agile environment with stakeholders, architects, and cross-regional teams towards decision making.", "Customized and extended Agentforce UI modules to streamline agent workflows, enabling real-time ticket updates and reducing average handling time (AHT) by 18% through seamless integration with backend microservices."]}, {"company": "Outlier AI", "title": "Software Development Engineer", "location": "Oakland, California, USA", "dates": "March 2024 - November 2024", "responsibilities": ["Built an LLM-based RFP generator using GPT-4, FAISS , &prompt engineering for automated proposal drafting.", "Engineered a hybrid RAG system with GPT-4-turbo, Gemini, FAISS (HNSW), and BM25, reducing token usage by 45.3% and increasing MRR by 41.8", "Enabled real-time FAISS vector DB refresh via OneDrive Graph delta sync, achieving 300ms latency and maintaining 100% embedding coverage over 3.2M tokens.", "Designed task-specific prompt scaffolds using few-shot and chain-of-thought patterns, cutting hallucinations by 36.1% and improving ROUGE-L by 22.4%.", "Deployed on Azure with Dockerized Flask services, CI/CD via GitHub Actions, and App Insights tracking BLEU , latency (p95 less than 1.2s), and ingestion drift."]}, {"company": "SAP Labs", "title": "Software Development Engineer", "location": "Bengaluru, Karnataka, India", "dates": "Oct 2019 - December 2021", "responsibilities": ["Engineered highly scalable microservices architecture using Java Spring Boot, achieving a 34% performance boost by integrating Redis for caching, optimizing Tomcat server configurations, and automated deployments with Ansible .", "Architected a NaaS platform with React, TypeScript, Redux , and Python , reducing device downtime by 63%.", "Improved deployment efficiency and system stability by containerizing applications with Docker and managing deployments using Kubernetes for faster rollouts and enhanced reliability.", "Developed APIs and GraphQL endpoints, reducing response times by 27%. Improved deployment speed by 34% using Terraform, AWS CloudFormation, and Ansible for automation", "Developed RESTful APIs &GraphQL endpoints, reducing response times by 33% through load balancing & caching.", "Boosted system throughput by 45% through performance testing and benchmarking using JMeter andGatling ."]}], "projects": [{"title": "Coding a Multisignature wallet", "technologies": "HTML/CSS, Javascript, web3, Rust, Solidity", "date": "June 2021"}, {"title": "Knowledge Representation Paradigm", "technologies": "Prolog, Reactjs, Redux, Nodejs", "date": "April 2022"}, {"title": "Classification of N-gram models", "technologies": "Pytorch, Natural Language Processing", "date": "January 2023"}], "technical_skills": {"programming_languages": ["Python", "Java", "Rust", "TypeScript", "JavaScript(ES6)", "C++", "SQL", "HTML/CSS", "PHP"], "developer_tools": ["AWS", "Google Cloud", "Docker", "Kubernetes", "Jenkins", "Prometheus", "Grafana", "ELK", "Redis", "CI/CD", "Git"], "technologies_frameworks": ["TensorFlow", "React", "Node.js", "Spring Boot", "RESTful APIs", "GraphQL", "Ansible", "web3"]}, "licenses_certifications": ["AWS Certified Solutions Architect - Associate", "Google Cloud Certified - Professional Data Engineer"]}