{"summary": "This Request for Information (RFI) issued by the Social Security Administration (SSA) seeks information from vendors regarding Web Content Management System (WCMS) solutions. The SSA aims to modernize its digital presence and improve content management capabilities by implementing a robust, user-friendly WCMS based on the Drupal platform. The primary objective is to identify potential solutions, including Platform as a Service (PaaS) hosting environments and Content Delivery Network (CDN) services, that meet specific technical and security requirements. The SSA is looking for a comprehensive, turn-key solution that offers scalability, FedRAMP certification, and seamless integration with existing infrastructure. The key business challenge is to enhance the agency's online services while ensuring compliance with federal security standards and providing a positive user experience. This RFI is for market research purposes only and does not constitute a solicitation or commitment to award a contract. The SSA intends to use the information gathered to create a Market Assessment Report, which may inform future budget and acquisition decisions.", "document_identification": {"type": "RFI", "title": "Web Content Management System (WCMS)", "number": "28321325RI0000040", "date_issued": null}, "issuing_organization": {"name": "Social Security Administration (SSA)", "acronym": "SSA"}, "key_dates": {"submission_deadline": "As indicated under Item 10 of the Standard Form 18 (SF 18).", "q_and_a_period": null, "decision_timeline": null}, "submission_requirements": {"format": "Capability statements, published pricing list, software license agreement and/or support agreement, completed Voluntary Product Accessibility Template (VPAT), completed Corporate Information Template.", "method": "Electronically via email", "email": " (email address not provided)", "subject_line": "Reference 28321325RI0000040 in the email subject line.", "other_instructions": "No telephone, mail, or fax responses will be accepted. Vendors must identify any proprietary information submitted."}, "evaluation_criteria": {"criteria": ["Demonstrated expertise in the described areas", "Technical demonstration of the product and services", "Cloud environment hosting details", "Deployment options", "FEDRAMP authorization details", "Licensing/pricing model", "Section 508 conformance (VPAT)", "Technical support options", "Customization details", "Implementation details", "Successful implementation details", "Government agency usage", "Software license agreement and/or support agreement", "Completed Voluntary Product Accessibility Template (VPAT)", "Completed Corporate Information Template"], "weights": null}, "project_scope": {"background": "The Social Security Administration (SSA) is researching the marketplace for potential products or solutions for Web Content Management Systems.", "purpose": "To seek support services and turn-key solutions for a comprehensive Web Content Management System (WCMS) based on the Drupal platform.", "requirements": ["Platform as a Service (PaaS) environment for Drupal WCMS", "FedRAMP Certified Hosting Environment", "Convenient and Transparent Deployment Management", "Scalability to accommodate future access and performance needs (estimated 55TB of object requests and 280 million site visitors per year)", "Interface with SSA-chosen CDN", "Limit traffic from all sources except the CDN and the DNS", "Interface with a reverse proxy or load balancer on SSANet", "Limit traffic from all sources except a reverse proxy or load balancer from the SSA network", "Accept connections directly from end users", "Enforcement of Transport Security Layer (TLS) and the use of HTTP Strict Transport Security (HSTS)", "Ability to allocate roles and assign permissions", "Hosting for the Drupal WCMS provided by the contractor", "Three tiers of support subscriptions", "Service level agreement (SLA) for SSA approval", "24/7 on-call support", "Multiple channels for contacting support", "Compatibility with Personal Identity Verification (PIV) Authentication", "Support Federated single sign-on (SSO) and multi-factor authentication (MFA)", "FEDRAMP certified and adhere to industry best practices", "Scaling with increased workloads", "Failover mechanisms and disaster recovery capabilities", "Section 508 compliance", "Support Internet Protocol version 6 (IPv6)", "Use encrypted communication (e.g., Secure Sockets Layer (SSL))", "APIs to manage security and access", "Audit / MI /BI capabilities", "Reports on user and systems statistics and processes", "Ad hoc and custom reporting functionality", "System health audit report", "Error and exception reports", "Data and metadata accessible, retrievable, and exportable by SSA", "Setup, configuration, maintenance and implementation support services"]}, "budget_information": null, "contract_terms": {"type": "RFI - No contract will be awarded", "duration": null}}